# аналогичный метод
# object.__del__(self) - вызывается перед уничтожением объекта


# рассмотрим
# __str__ - вызывается при преобразовании объекта к строке str(obj)
# например print(my_backpack)

# аналогичные методы
# __len__ - вызывается для получения "размера" объекта с помощью функции len()
# __hash__ - вызывается для получения уникального хэша объекта с помощью функции hash()
#               или для операций с хэширующими коллекциями - множества и словари
# __bool__ - вызывается для получения "истинности" объекта с помощью функции bool()




