def create_object():
    number = 15
    string = "Строка"
    number_2 = int()
    string_2 = string

def method_string(string = 'Любая строка'):

    string[0]	#Обращение по индексу
    string[1:5]	#Извлечение среза
    len(string)	#Длина строки
    string.find(str)	#Поиск подстроки в строке. Возвращает номер первого вхождения или -1
    string.rfind(str)	#Поиск подстроки в строке. Возвращает номер последнего вхождения или -1
    string.index(str)	#Поиск подстроки в строке. Возвращает номер первого вхождения или вызывает ValueError
    string.rindex(str)	#Поиск подстроки в строке. Возвращает номер последнего вхождения или вызывает ValueError
    string.replace("Любая", 'Заменим на это')	#Замена шаблона на замену. maxcount ограничивает количество замен
    string.split(" ")	#Разбиение строки по разделителю
    string.isdigit()	#Состоит ли строка из цифр
    string.isalpha()	#Состоит ли строка из букв
    string.isalnum()	#Состоит ли строка из цифр или букв
    string.islower()	#Состоит ли строка из символов в нижнем регистре
    string.isupper()	#Состоит ли строка из символов в верхнем регистре
    string.isspace()	#Состоит ли строка из неотображаемых символов (пробел, символ перевода страницы ('\f'), "новая строка" ('\n'), "перевод каретки" ('\r'), "горизонтальная табуляция" ('\t') и "вертикальная табуляция" ('\v'))
    string.istitle()	#Начинаются ли слова в строке с заглавной буквы
    string.upper()	#Преобразование строки к верхнему регистру
    string.lower()	#Преобразование строки к нижнему регистру
    string.startswith(str)	#Начинается ли строка string с шаблона str
    string.endswith(str)	#Заканчивается ли строка string шаблоном str
    string.join([1, 2, 3])	#Сборка строки из списка с разделителем string
    string.capitalize()	#Переводит первый символ строки в верхний регистр, а все остальные в нижний
    string.count(str)	#Возвращает количество непересекающихся вхождений подстроки в диапазоне [начало, конец] (0 и длина строки по умолчанию)
    #string.expandtabs([tabsize])	#Возвращает копию строки, в которой все символы табуляции заменяются одним или несколькими пробелами, в зависимости от текущего столбца. Если TabSize не указан, размер табуляции полагается равным 8 пробелам
    string.lstrip()	#Удаление пробельных символов в начале строки
    string.rstrip()	#Удаление пробельных символов в конце строки
    string.strip()	#Удаление пробельных символов в начале и в конце строки
    #string.partition(шаблон)	#Возвращает кортеж, содержащий часть перед первым шаблоном, сам шаблон, и часть после шаблона. Если шаблон не найден, возвращается кортеж, содержащий саму строку, а затем две пустых строки
   # string.rpartition(sep)	#Возвращает кортеж, содержащий часть перед последним шаблоном, сам шаблон, и часть после шаблона. Если шаблон не найден, возвращается кортеж, содержащий две пустых строки, а затем саму строку
    string.swapcase()	#Переводит символы нижнего регистра в верхний, а верхнего – в нижний
